Revit 2027 API
RebarContainerType.CreateDefaultRebarContainerType Method
 Creates a new RebarContainerType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultRebarContainerType(
	Document aDoc
)
Public Shared Function CreateDefaultRebarContainerType (
	aDoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultRebarContainerType(
	Document^ aDoc
)
static member CreateDefaultRebarContainerType :
        aDoc : Document -> ElementId
Parameters
aDoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace